package org.example.part3;

public class Tasks6 {
    public static void main(String[] args) {


//  Для тех, кому все легко

//  Задача 1: Найти k-ую перестановку из n элементов
//  Дано число n и число k, необходимо найти k-ую перестановку из n элементов.



//  Задача 2: Разбить список на подсписки заданного размера
//  Дан список элементов и размер подсписков. Необходимо разбить список
//  на подсписки указанного размера.



// Для людей-индиго
// Задача 3:Найти сумму квадратов простых чисел, которые являются палиндромами в заданном диапазоне.



    }
}
